cf_billing/InformationRegisters/бестМаксимальныеПоказанияНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестМаксимальныеПоказанияНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргМаксимальныеПоказателиПотребления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргМаксимальныеПоказателиПотребления</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПовышающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестКоэффициентыПоказателейПотребления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестКоэффициентыПоказателейПотребления</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПовышающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестКоэффциентыПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестКоэффциентыПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДопустимыйОбъемОтклоненийПоПоказаниям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДопустимыйОбъемОтклоненийПоПоказаниям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестЦеновыеКатегорииТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЦеновыеКатегорииТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДанныеПочасовойВедомости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДанныеПочасовойВедомости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьКоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Час</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСреднийОбъемПотребленияНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСреднийОбъемПотребленияНП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/бестРаботаСПоказаниямиПриборовУчетаНПСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обновляет показания прибора учета.
//
// Параметры:
//  ТабЧасть			-	ДанныеФормыКоллекция	-	ТЧ с показаниями.
//  Параметры			-	Структура:
//   * ТочкаУчета	-	СправочникСсылка.энргТочкиУчета.
//   * Услуга		-	СправочникСсылка.энргВидыУслуг.
//  ВыводПрибораУчета	-	Булево.
//
Процедура ОбновитьПоказанияПрибораУчета(ТабЧасть, Параметры, ВыводПрибораУчета = Неопределено) Экспорт 
			
	// заполняем табличную часть приборы
	Запрос	= Новый Запрос;
	МВТ		= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц	= МВТ;

	МаксимальныеПоказанияСрезПоследних(МВТ,"энргМаксимальныеПоказанияСрезПоследних",Параметры);
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ТарифныеЗоныПриборовУчета
	|ИЗ
	|	Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ГДЕ энргВидыДифференцированностиТарифныеЗоны.Ссылка = &ВидДифференцированности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифныеЗоныПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрезПоследних.Период КАК ДатаПоследнихПоказаний,
	|	энргМаксимальныеПоказанияСрезПоследних.Показание КАК ПредыдущиеПоказания
	|ИЗ
	|	ТарифныеЗоныПриборовУчета КАК ТарифныеЗоныПриборовУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ энргМаксимальныеПоказанияСрезПоследних КАК энргМаксимальныеПоказанияСрезПоследних
	|		ПО ТарифныеЗоныПриборовУчета.ТарифнаяЗона = энргМаксимальныеПоказанияСрезПоследних.ТарифнаяЗона
	|";  
	
	Запрос.Текст	= Текст;
	Запрос.УстановитьПараметр("ВидДифференцированности", Параметры.ВидДифференцированности);
	Результат		= Запрос.Выполнить();
	Выборка			= Результат.Выбрать();
	
	СоотвествиеПоказаний 					= Новый Соответствие;
	// Ищем строки по индентификатору
	Если ВыводПрибораУчета <> Неопределено Тогда
		СтруктураПоиска  						= Новый Структура("IDСтроки,ВыводПрибораУчета", Параметры.IDСтроки, ВыводПрибораУчета);
	Иначе
		СтруктураПоиска  						= Новый Структура("IDСтроки", Параметры.IDСтроки);	
	КонецЕсли;
	СтрокиСоотвествия 						= ТабЧасть.НайтиСтроки(СтруктураПоиска);	
	 
	для Каждого СтрокаСоотвествия из СтрокиСоотвествия цикл
		СоотвествиеПоказаний.Вставить(СтрокаСоотвествия.ТарифнаяЗона,СтрокаСоотвествия.ТекущиеПоказания);
		ТабЧасть.Удалить(СтрокаСоотвествия);
	КонецЦикла;  
	
	
	Пока выборка.Следующий() цикл		 
		СтрокаПоказаний  			= ТабЧасть.добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний, Выборка);
		СтрокаПоказаний.IDСтроки 	= Параметры.IDСтроки; 		
		Если ВыводПрибораУчета <> Неопределено Тогда
			СтрокаПоказаний.ВыводПрибораУчета 	= ВыводПрибораУчета;
		КонецЕсли;
		
		Если СоотвествиеПоказаний[выборка.ТарифнаяЗона] <> Неопределено тогда
			СтрокаПоказаний.ТекущиеПоказания 	= СоотвествиеПоказаний[выборка.ТарифнаяЗона];
		КонецЕсли;
		
	КонецЦикла;   
	
КонецПроцедуры

// Дополняет МВТ данными из РС бестМаксимальныеПоказанияНП.
//
// Параметры:
//  МВТ			-	МенеджерВременныхТаблиц.
//  ИмяТаблицы	-	Строка.
//  Параметры	-	Структура:
//   * Организация		-	СправочникСсылка.Организации.
//   * Район			-	СправочникСсылка.энргЗоныОтвественности.
//   * Дата				-	Дата.
//   * ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//
Процедура МаксимальныеПоказанияСрезПоследних(МВТ,ИмяТаблицы,Параметры) Экспорт
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст = 
	"ВЫБРАТЬ
	|	бестМаксимальныеПоказанияНП.Район КАК Район,
	|	бестМаксимальныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияНП.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияНП.Период КАК Период,
	|	бестМаксимальныеПоказанияНП.Регистратор КАК Регистратор,
	|	бестМаксимальныеПоказанияНП.Разделитель КАК Разделитель,
	|	бестМаксимальныеПоказанияНП.Показание КАК Показание,
	|	бестМаксимальныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ Набор
	|ИЗ
	|	РегистрСведений.бестМаксимальныеПоказанияНП КАК бестМаксимальныеПоказанияНП
	|ГДЕ
	|	бестМаксимальныеПоказанияНП.Организация = &Организация
	|	И бестМаксимальныеПоказанияНП.Район = &Район
	|	И бестМаксимальныеПоказанияНП.ПриборУчета = &ПриборУчета
	|	И бестМаксимальныеПоказанияНП.Период <= &МоментВремениПериод
	|	И бестМаксимальныеПоказанияНП.Регистратор <= &МоментВремениРегистратор
	|	И бестМаксимальныеПоказанияНП.ОбъектРасчета В(&ОбъектРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.Район КАК Район,
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	Набор.Шкала КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(Набор.Период) КАК Период,
	|	Набор.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ МаксимальнаяДатаРегистратора
	|ИЗ
	|	Набор КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.Район,
	|	Набор.ПриборУчета,
	|	Набор.Шкала,
	|	Набор.ТарифнаяЗона,
	|	Набор.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальнаяДатаРегистратора.Район КАК Район,
	|	МаксимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	|	МаксимальнаяДатаРегистратора.Шкала КАК Шкала,
	|	МаксимальнаяДатаРегистратора.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальнаяДатаРегистратора.Период КАК Период,
	|	МАКСИМУМ(Набор.Регистратор) КАК Регистратор,
	|	МаксимальнаяДатаРегистратора.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ МаксимумРегистратор
	|ИЗ
	|	МаксимальнаяДатаРегистратора КАК МаксимальнаяДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Набор КАК Набор
	|		ПО МаксимальнаяДатаРегистратора.Район = Набор.Район
	|			И МаксимальнаяДатаРегистратора.ПриборУчета = Набор.ПриборУчета
	|			И МаксимальнаяДатаРегистратора.Шкала = Набор.Шкала
	|			И МаксимальнаяДатаРегистратора.ТарифнаяЗона = Набор.ТарифнаяЗона
	|			И МаксимальнаяДатаРегистратора.Период = Набор.Период
	|			И МаксимальнаяДатаРегистратора.ОбъектРасчета = Набор.ОбъектРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальнаяДатаРегистратора.Район,
	|	МаксимальнаяДатаРегистратора.ПриборУчета,
	|	МаксимальнаяДатаРегистратора.Шкала,
	|	МаксимальнаяДатаРегистратора.ТарифнаяЗона,
	|	МаксимальнаяДатаРегистратора.Период,
	|	МаксимальнаяДатаРегистратора.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимумРегистратор.Район КАК Район,
	|	МаксимумРегистратор.ПриборУчета КАК ПриборУчета,
	|	МаксимумРегистратор.Шкала КАК Шкала,
	|	МаксимумРегистратор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимумРегистратор.Период КАК Период,
	|	МаксимумРегистратор.Регистратор КАК Регистратор,
	|	МАКСИМУМ(Набор.Разделитель) КАК Разделитель,
	|	МаксимумРегистратор.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ МаксимумРазделить
	|ИЗ
	|	МаксимумРегистратор КАК МаксимумРегистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Набор КАК Набор
	|		ПО МаксимумРегистратор.Район = Набор.Район
	|			И МаксимумРегистратор.ПриборУчета = Набор.ПриборУчета
	|			И МаксимумРегистратор.Шкала = Набор.Шкала
	|			И МаксимумРегистратор.ТарифнаяЗона = Набор.ТарифнаяЗона
	|			И МаксимумРегистратор.Период = Набор.Период
	|			И МаксимумРегистратор.Регистратор = Набор.Регистратор
	|			И МаксимумРегистратор.ОбъектРасчета = Набор.ОбъектРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимумРегистратор.Регистратор,
	|	МаксимумРегистратор.Район,
	|	МаксимумРегистратор.ПриборУчета,
	|	МаксимумРегистратор.Шкала,
	|	МаксимумРегистратор.ТарифнаяЗона,
	|	МаксимумРегистратор.Период,
	|	МаксимумРегистратор.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.Район КАК Район,
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	Набор.Шкала КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Набор.Период КАК Период,
	|	Набор.Регистратор КАК Регистратор,
	|	Набор.Разделитель КАК Разделитель,
	|	Набор.Показание КАК Показание,
	|	Набор.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ энргМаксимальныеПоказанияСрезПоследних
	|ИЗ
	|	Набор КАК Набор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимумРазделить КАК МаксимумРазделить
	|		ПО Набор.Район = МаксимумРазделить.Район
	|			И Набор.ПриборУчета = МаксимумРазделить.ПриборУчета
	|			И Набор.Шкала = МаксимумРазделить.Шкала
	|			И Набор.ТарифнаяЗона = МаксимумРазделить.ТарифнаяЗона
	|			И Набор.Период = МаксимумРазделить.Период
	|			И Набор.Регистратор = МаксимумРазделить.Регистратор
	|			И Набор.Разделитель = МаксимумРазделить.Разделитель
	|			И Набор.ОбъектРасчета = МаксимумРазделить.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Набор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимальнаяДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимумРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимумРазделить";
	
	Если не Параметры.свойство("Район") тогда
		Текст = СтрЗаменить(Текст,"энргМаксимальныеПоказанияРазделитель.Район = &Район","Истина");
	иначе
		Запрос.УстановитьПараметр("Район",Параметры.Район);
	КонецЕсли;
	 	
	Если не Параметры.свойство("ПриборУчета") тогда
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.ПриборУчета = &ПриборУчета","");
	ИначеЕсли ТипЗнч(Параметры.ПриборУчета) = тип("Массив") тогда
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.ПриборУчета = &ПриборУчета","И бестМаксимальныеПоказанияНП.ПриборУчета в (&ПриборыУчета)");
		Запрос.УстановитьПараметр("ПриборыУчета",Параметры.ПриборУчета)
	иначе	
		Запрос.УстановитьПараметр("ПриборУчета",Параметры.ПриборУчета);
	КонецЕсли;

	Если не Параметры.свойство("Дата") тогда
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.Период <= &МоментВремениПериод","");
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.Регистратор <= &МоментВремениРегистратор","");
	ИначеЕсли Параметры.Дата = Неопределено тогда
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.Период <= &МоментВремениПериод","");
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.Регистратор <= &МоментВремениРегистратор","");
	ИначеЕсли ТипЗнч(Параметры.Дата) = Тип("Дата") тогда 
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.Регистратор <= &МоментВремениРегистратор","");
		Запрос.УстановитьПараметр("МоментВремениПериод",Параметры.Дата); 
		
	ИначеЕсли  ТипЗнч(Параметры.Дата) = Тип("Граница")
		и  Параметры.Дата.ВидГраницы = ВидГраницы.Исключая
		и ТипЗнч(Параметры.Дата.Значение) = Тип("Дата")  тогда	
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.Период <= &МоментВремениПериод","И бестМаксимальныеПоказанияНП.Период < &МоментВремениПериод");
		Текст = СтрЗаменить(Текст,"И бестМаксимальныеПоказанияНП.Регистратор <= &МоментВремениРегистратор","");
		Запрос.УстановитьПараметр("МоментВремениПериод",Параметры.Дата.Значение);
	иначе 		
		Запрос.УстановитьПараметр("МоментВремениПериод",Параметры.Дата.дата);
		Запрос.УстановитьПараметр("МоментВремениРегистратор",Параметры.Дата.ссылка);
	КонецЕсли;
	
	Если не Параметры.свойство("ОбъектРасчета") тогда
		Текст = СтрЗаменить(Текст,"бестМаксимальныеПоказанияНП.ОбъектРасчета В(&ОбъектРасчета)","Истина");
	иначе
		Запрос.УстановитьПараметр("ОбъектРасчета",Параметры.ОбъектРасчета);
	КонецЕсли;

	
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);

	Текст 			= СтрЗаменить(Текст,"ПОМЕСТИТЬ энргМаксимальныеПоказанияСрезПоследних","ПОМЕСТИТЬ " + ИмяТаблицы);	
	Запрос.Текст 	= Текст;
	Запрос.Выполнить();
	
КонецПроцедуры 

// Заполняет ТЧ показания прибора учета.
//
// Параметры:
//  ТочкиУчета		 - СправочникСсылка.энргТочкиУчета.
//  ШкалыПриборов	 - СправочникСсылка.энргШкалыПриборовУчета.
//  ТаблицаПоказаний - ТЧ с показаниями.
//  МоментВремени	 - МоментВремени.
//  Организация		 - СправочникСсылка.Организации.
//  Район			 - СправочникСсылка.энргЗоныОтвественности.
//  КонтрольныйСъем	 - Булево.
//  ЭтоВывод		 - Булево.
//
Процедура ОбновитьТЧПоказанияПрибораУчета(ТочкиУчета,ШкалыПриборов,ТаблицаПоказаний,МоментВремени,Организация,Район,КонтрольныйСъем = ложь, ЭтоВывод = Ложь) Экспорт 
		
	// заполняем табличную часть приборы
	Если ТипЗнч(МоментВремени) = тип("Граница") тогда
		ПериодНачисления 					= Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(МоментВремени.Значение, Организация, Район);
	иначе
		ПериодНачисления 					= Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(МоментВремени, Организация, Район);
	КонецЕсли;
			              	
	Если ТипЗнч(ТаблицаПоказаний)  = Тип("ТаблицаЗначений") тогда
		тзТаблицаПоказаний 					= ТаблицаПоказаний;		
	иначе                  		
		тзТаблицаПоказаний					= ТаблицаПоказаний.Выгрузить();
	КонецЕсли;
	
	тзТаблицаПоказаний.Колонки.добавить("ТочкаУчета",				Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	тзТаблицаПоказаний.Колонки.добавить("Услуга",					Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	тзТаблицаПоказаний.Колонки.добавить("ПриборУчета",				Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	
	// Ошибка после добавления узлов.Узлы переделать.
	Попытка
		тзТаблицаПоказаний.Колонки.добавить("IDСтрокиТочкиУчета",		Новый ОписаниеТипов("УникальныйИдентификатор"));
	Исключение
	КонецПопытки;
	// Ошибка после добавления узлов
	
	тзТаблицаПоказаний.Колонки.добавить("ВидДифференцированности",	Новый ОписаниеТипов("СправочникСсылка.энргВидыДифференцированности"));
	тзТаблицаПоказаний.Колонки.добавить("Шкала",					Новый ОписаниеТипов("СправочникСсылка.энргШкалыПриборовУчета"));
	
	Для Каждого СтрокаТочкиУчета из ТочкиУчета цикл
		СтрокиШкал 											= ШкалыПриборов.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета.IDСтроки));		
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			СтрокиТарифнойЗоны								= тзТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки",СтрокаШкалы.IDСтроки));
			Для Каждого СтрокаТарифнойЗоны из СтрокиТарифнойЗоны цикл
				СтрокаТарифнойЗоны.ТочкаУчета 				= СтрокаТочкиУчета.ТочкаУчета;
				СтрокаТарифнойЗоны.Услуга 					= СтрокаТочкиУчета.Услуга;
				Если ЭтоВывод Тогда
					СтрокаТарифнойЗоны.ПриборУчета 				= СтрокаТочкиУчета.ПриборУчетаВывод;
				Иначе
					СтрокаТарифнойЗоны.ПриборУчета 				= СтрокаТочкиУчета.ПриборУчета;
				КонецЕсли;
				СтрокаТарифнойЗоны.IDСтрокиТочкиУчета 		= СтрокаТочкиУчета.IDСтроки;
				СтрокаТарифнойЗоны.IDСтроки 				= СтрокаШкалы.IDСтроки;
				СтрокаТарифнойЗоны.ВидДифференцированности 	= СтрокаШкалы.ВидДифференцированности;
				СтрокаТарифнойЗоны.Шкала 					= СтрокаШкалы.Шкала;
			КонецЦикла;
		КонецЦикла; 		
	КонецЦикла;		
	
	МВТ  									= Новый МенеджерВременныхТаблиц;
//	ТаблицаЗначенийТарифов 					= энргРаботаСприборамиУчетаСервер.ТаблицаЗначенийТарифов(МоментВремени,Организация,Район,Договор);
	Параметры  								= Новый Структура("Организация,Район,Дата",Организация, Район, новый Граница(МоментВремени, ВидГраницы.Исключая));
   	
	МаксимальныеПоказанияСрезПоследних(МВТ,"энргМаксимальныеПоказанияСрезПоследних",Параметры);
	
	ПериодНачисленияПредыдущегоГода = ДобавитьМесяц(ПериодНачисления, -12);
	ПериодНачисленияПредыдущегоМесяца = ДобавитьМесяц(ПериодНачисления, -1);
	ГраницаПредыдущегоГода	= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисленияПредыдущегоГода);
	ГраницаПредыдущегоМесяца = Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисленияПредыдущегоМесяца);
	
	ЦеновыеКатегории = Новый Массив;
	ЦеновыеКатегории.Добавить(Перечисления.бестЦеновыеКатегории.ТретьяЦК);
	ЦеновыеКатегории.Добавить(Перечисления.бестЦеновыеКатегории.ЧетвертаяЦК);
	ЦеновыеКатегории.Добавить(Перечисления.бестЦеновыеКатегории.ПятаяЦК);
	ЦеновыеКатегории.Добавить(Перечисления.бестЦеновыеКатегории.ШестаяЦК);
	
	Запрос  								= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 			= МВТ;
	Запрос.УстановитьПараметр("МоментВремени",			МоментВремени);
	Запрос.УстановитьПараметр("ТекущиеДанные",			тзТаблицаПоказаний);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);	
	Запрос.УстановитьПараметр("КонтрольныйСъем",		КонтрольныйСъем); 	
	Запрос.УстановитьПараметр("Коэффициент",			1);	
	Запрос.УстановитьПараметр("ЦеновыеКатегории",		ЦеновыеКатегории);	
	Запрос.УстановитьПараметр("НачалоПериодаПредыдущегоГода",	ГраницаПредыдущегоГода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериодаПредыдущегоГода",	ГраницаПредыдущегоГода.ЗавершениеОП - 1);
	Запрос.УстановитьПараметр("НачалоПериодаПредыдущегоМесяца",	ГраницаПредыдущегоМесяца.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериодаПредыдущегоМесяца",	ГраницаПредыдущегоМесяца.ЗавершениеОП - 1);
	
	Текст =
	"ВЫБРАТЬ
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.МаксимальноеПотребления КАК МаксимальноеПотребления
	|ПОМЕСТИТЬ МаксимальныеПоказателиПотребления
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказателиПотребления.СрезПоследних(&МоментВремени, ) КАК энргМаксимальныеПоказателиПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестКоэффициентыПоказателейПотребленияСрезПоследних.Услуга КАК Услуга,
	|	бестКоэффициентыПоказателейПотребленияСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестКоэффициентыПоказателейПотребленияСрезПоследних.ПовышающийКоэффициент КАК ПовышающийКоэффициент
	|ПОМЕСТИТЬ ПовышающийКоэф
	|ИЗ
	|	РегистрСведений.бестКоэффициентыПоказателейПотребления.СрезПоследних(&МоментВремени, Организация = &Организация) КАК бестКоэффициентыПоказателейПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности,
	|	ТекущиеДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанныеДокумента.Шкала КАК Шкала,
	|	ТекущиеДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанныеДокумента.Услуга КАК Услуга,
	|	ТекущиеДанныеДокумента.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанныеДокумента.Переворот КАК Переворот,
	|	ТекущиеДанныеДокумента.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанныеДокумента.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ТекущиеДанныеДокумента.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоэффциентыПриборовУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ КоэффциентыПриборовУчета
	|ИЗ
	|	РегистрСведений.бестКоэффциентыПриборовУчетаНП.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						ТекущиеДанные.ТочкаУчета
	|					ИЗ
	|						ТекущиеДанные КАК ТекущиеДанные)) КАК энргКоэффциентыПриборовУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДопустимыйОбъемОтклоненийПоПоказаниямСрезПоследних.Услуга КАК Услуга,
	|	ДопустимыйОбъемОтклоненийПоПоказаниямСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДопустимыйОбъемОтклоненийПоПоказаниямСрезПоследних.Объем КАК ДопустимыйОбъемОтклонений
	|ПОМЕСТИТЬ ДопустимыйОбъемОтклоненийПоПоказаниям
	|ИЗ
	|	РегистрСведений.бестДопустимыйОбъемОтклоненийПоПоказаниям.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Услуга В
	|					(ВЫБРАТЬ
	|						ТекущиеДанные.Услуга
	|					ИЗ
	|						ТекущиеДанные КАК ТекущиеДанные)) КАК ДопустимыйОбъемОтклоненийПоПоказаниямСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ЦеновыеКатегорииТочекУчета
	|ИЗ
	|	РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						ТекущиеДанные.ТочкаУчета
	|					ИЗ
	|						ТекущиеДанные КАК ТекущиеДанные)) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|ГДЕ
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория В(&ЦеновыеКатегории)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеновыеКатегорииТочекУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ЦеновыеКатегорииТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанные.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыПоискаПочасовойВедомости
	|ИЗ
	|	ЦеновыеКатегорииТочекУчета КАК ЦеновыеКатегорииТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеДанные КАК ТекущиеДанные
	|		ПО ЦеновыеКатегорииТочекУчета.ТочкаУчета = ТекущиеДанные.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыПоискаПочасовойВедомости.ПриборУчета КАК ПриборУчета,
	|	СУММА(бестДанныеПочасовойВедомости.Объем) КАК Объем
	|ПОМЕСТИТЬ ОбъемыПочасовойВедомости
	|ИЗ
	|	ПриборыПоискаПочасовойВедомости КАК ПриборыПоискаПочасовойВедомости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестДанныеПочасовойВедомости КАК бестДанныеПочасовойВедомости
	|		ПО (бестДанныеПочасовойВедомости.Организация = &Организация)
	|			И (бестДанныеПочасовойВедомости.Район = &Район)
	|			И ПриборыПоискаПочасовойВедомости.ОбъектРасчета = бестДанныеПочасовойВедомости.ОбъектРасчета
	|			И ПриборыПоискаПочасовойВедомости.ТочкаУчета = бестДанныеПочасовойВедомости.ТочкаУчета
	|			И ПриборыПоискаПочасовойВедомости.ПриборУчета = бестДанныеПочасовойВедомости.ПриборУчета
	|			И (бестДанныеПочасовойВедомости.ПериодНачисления = &ПериодНачисления)
	|			И (бестДанныеПочасовойВедомости.План = ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриборыПоискаПочасовойВедомости.ПриборУчета"
	
	+ ОбщегоНазначения.РазделительПакетаЗапросов()
	+ ТекстЗапросаРазницаПоказанийСхожегоПериода("ОбъемПредыдущегоГода", "НачалоПериодаПредыдущегоГода", "КонецПериодаПредыдущегоГода")
	+ ТекстЗапросаРазницаПоказанийСхожегоПериода("ОбъемПредыдущегоМесяца", "НачалоПериодаПредыдущегоМесяца", "КонецПериодаПредыдущегоМесяца")
	+ 
	"ВЫБРАТЬ
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанные.Шкала КАК Шкала,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.Переворот КАК ТекущийПереворот,
	|	ТекущиеДанные.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанные.СостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ЕСТЬNULL(КоэффциентыПриборовУчета.Коэффициент, 0) КАК Коэффициент,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможные,
	|	ЕСТЬNULL(МаксимальныеПоказателиПотребления.МаксимальноеПотребления, 0) КАК МаксимальныйОбъемПотребления,
	|	ЕСТЬNULL(ДопустимыйОбъемОтклоненийПоПоказаниям.ДопустимыйОбъемОтклонений, 0) КАК ДопустимыйОбъемОтклонений,
	|	ЕСТЬNULL(ОбъемыПочасовойВедомости.Объем, -1) КАК ОбъемПочасовойВедомости
	|ПОМЕСТИТЬ ДанныеДокументаСПоказаниями
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффциентыПриборовУчета КАК КоэффциентыПриборовУчета
	|		ПО ТекущиеДанные.ТочкаУчета = КоэффциентыПриборовУчета.ТочкаУчета
	|			И ТекущиеДанные.ПриборУчета = КоэффциентыПриборовУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ТекущиеДанные.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказателиПотребления КАК МаксимальныеПоказателиПотребления
	|		ПО ТекущиеДанные.Услуга = МаксимальныеПоказателиПотребления.Услуга
	|			И ТекущиеДанные.ТарифнаяЗона = МаксимальныеПоказателиПотребления.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДопустимыйОбъемОтклоненийПоПоказаниям КАК ДопустимыйОбъемОтклоненийПоПоказаниям
	|		ПО ТекущиеДанные.Услуга = ДопустимыйОбъемОтклоненийПоПоказаниям.Услуга
	|			И ТекущиеДанные.ТарифнаяЗона = ДопустимыйОбъемОтклоненийПоПоказаниям.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыПочасовойВедомости КАК ОбъемыПочасовойВедомости
	|		ПО ТекущиеДанные.ПриборУчета = ОбъемыПочасовойВедомости.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	СреднийОбъемПотребленияАбонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СреднийОбъемПотребленияАбонентов.Шкала КАК Шкала,
	|	СреднийОбъемПотребленияАбонентов.Объем КАК Объем
	|ПОМЕСТИТЬ СреднийОбъемПотребления
	|ИЗ
	|	РегистрСведений.бестСреднийОбъемПотребленияНП КАК СреднийОбъемПотребленияАбонентов
	|ГДЕ
	|	СреднийОбъемПотребленияАбонентов.Организация = &Организация
	|	И СреднийОбъемПотребленияАбонентов.ПериодНачисления = &ПериодНачисления
	|	И СреднийОбъемПотребленияАбонентов.Район = &Район
	|	И СреднийОбъемПотребленияАбонентов.ТочкаУчета В
	|			(ВЫБРАТЬ
	|				ТекущиеДанные.ТочкаУчета
	|			ИЗ
	|				ТекущиеДанные КАК ТекущиеДанные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументаСПоказаниями.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокументаСПоказаниями.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) КАК ПоследниеПоказания,
	|	ДанныеДокументаСПоказаниями.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ЕСТЬNULL(СреднийОбъемПотребления.Объем, 0) КАК СреднийОбъемПотребления,
	|	ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнихПоказаний,
	|	(ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)) * ДанныеДокументаСПоказаниями.Коэффициент КАК Расход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) < ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)
	|			ТОГДА (ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) - ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0)) * ДанныеДокументаСПоказаниями.Коэффициент
	|		ИНАЧЕ (ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)) * ДанныеДокументаСПоказаниями.Коэффициент
	|	КОНЕЦ КАК РасходПоМодулю,
	|	(ДанныеДокументаСПоказаниями.МаксимальноВозможные - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) + ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0)) * ДанныеДокументаСПоказаниями.Коэффициент КАК РасходСПереворотом,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СреднийОбъемПотребления.Объем, 0) > ДанныеДокументаСПоказаниями.МаксимальныйОбъемПотребления
	|			ТОГДА ЕСТЬNULL(СреднийОбъемПотребления.Объем, 0)
	|		ИНАЧЕ ДанныеДокументаСПоказаниями.МаксимальныйОбъемПотребления
	|	КОНЕЦ * &Коэффициент * ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК МаксимальныйРасходЗаПериод,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК РазностьМесяцев,
	|	ДанныеДокументаСПоказаниями.Коэффициент КАК КоэффициентПУ,
	|	ДанныеДокументаСПоказаниями.ТекущийПереворот КАК ТекущийПереворот,
	|	ДанныеДокументаСПоказаниями.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ДанныеДокументаСПоказаниями.ТекущиеСостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ДанныеДокументаСПоказаниями.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ДанныеДокументаСПоказаниями.МаксимальноВозможные КАК МаксимальноВозможныеПоказания,
	|	ДанныеДокументаСПоказаниями.МаксимальныйОбъемПотребления КАК МаксимальноВозможныйОбъемПотребления,
	|	ДанныеДокументаСПоказаниями.Услуга КАК Услуга,
	|	ДанныеДокументаСПоказаниями.ДопустимыйОбъемОтклонений КАК ДопустимыйОбъемОтклонений,
	|	ОбъемПредыдущегоГода.Разница КАК РасходЗаАналогичныйПериодПредГода,
	|	ОбъемПредыдущегоМесяца.Разница КАК РасходЗаПредМесяц,
	|	ДанныеДокументаСПоказаниями.ОбъемПочасовойВедомости КАК ОбъемПочасовойВедомости
	|ПОМЕСТИТЬ ДанныеДляАнализа
	|ИЗ
	|	ДанныеДокументаСПоказаниями КАК ДанныеДокументаСПоказаниями
	|		ЛЕВОЕ СОЕДИНЕНИЕ энргМаксимальныеПоказанияСрезПоследних КАК энргМаксимальныеПоказанияСрезПоследних
	|		ПО ДанныеДокументаСПоказаниями.ПриборУчета = энргМаксимальныеПоказанияСрезПоследних.ПриборУчета
	|			И ДанныеДокументаСПоказаниями.Шкала = энргМаксимальныеПоказанияСрезПоследних.Шкала
	|			И ДанныеДокументаСПоказаниями.ТарифнаяЗона = энргМаксимальныеПоказанияСрезПоследних.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъемПотребления КАК СреднийОбъемПотребления
	|		ПО ДанныеДокументаСПоказаниями.ТочкаУчета = СреднийОбъемПотребления.ТочкаУчета
	|			И ДанныеДокументаСПоказаниями.ТарифнаяЗона = СреднийОбъемПотребления.ТарифнаяЗона
	|			И ДанныеДокументаСПоказаниями.Шкала = СреднийОбъемПотребления.Шкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемПредыдущегоГода КАК ОбъемПредыдущегоГода
	|		ПО ДанныеДокументаСПоказаниями.ПриборУчета = ОбъемПредыдущегоГода.ПриборУчета
	|			И ДанныеДокументаСПоказаниями.Шкала = ОбъемПредыдущегоГода.Шкала
	|			И ДанныеДокументаСПоказаниями.ТарифнаяЗона = ОбъемПредыдущегоГода.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемПредыдущегоМесяца КАК ОбъемПредыдущегоМесяца
	|		ПО ДанныеДокументаСПоказаниями.ПриборУчета = ОбъемПредыдущегоМесяца.ПриборУчета
	|			И ДанныеДокументаСПоказаниями.Шкала = ОбъемПредыдущегоМесяца.Шкала
	|			И ДанныеДокументаСПоказаниями.ТарифнаяЗона = ОбъемПредыдущегоМесяца.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляАнализа.НомерСтроки КАК НомерСтроки,
	|	ДанныеДляАнализа.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляАнализа.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущийПереворот
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК Переворот,
	|	ДанныеДляАнализа.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	ДанныеДляАнализа.СреднийОбъемПотребления * ЕСТЬNULL(ПовышающийКоэф.ПовышающийКоэффициент, 1) * ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ДанныеДляАнализа.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ДанныеДляАнализа.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК СреднийОбъемПотребления,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляАнализа.ТекущийПереворот
	|						ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|					ИНАЧЕ ДанныеДляАнализа.Расход
	|				КОНЕЦ
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА 0
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ДанныеДляАнализа.Расход
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|					ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|				ИНАЧЕ -ДанныеДляАнализа.РасходПоМодулю
	|			КОНЕЦ
	|	КОНЕЦ КАК Разница,
	|	ЛОЖЬ КАК ПереворотИзмененПользователем,
	|	ЛОЖЬ КАК СтатусИзмененПользователем,
	|	ДанныеДляАнализа.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ДанныеДляАнализа.МаксимальноВозможныйОбъемПотребления КАК МаксимальноВозможныйОбъемПотребления,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущиеСостояниеПоказаний
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|		КОГДА ДанныеДляАнализа.Расход = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		КОГДА &КонтрольныйСъем
	|				И ВЫБОР
	|					КОГДА ДанныеДляАнализа.Расход >= 0
	|						ТОГДА ДанныеДляАнализа.Расход
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|								ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|							ИНАЧЕ -ДанныеДляАнализа.РасходПоМодулю
	|						КОНЕЦ
	|				КОНЕЦ >= 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		КОГДА ВЫБОР
	|				КОГДА ДанныеДляАнализа.Расход >= 0
	|					ТОГДА ДанныеДляАнализа.Расход
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|							ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|						ИНАЧЕ ДанныеДляАнализа.Расход
	|					КОНЕЦ
	|			КОНЕЦ >= 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ДанныеДляАнализа.Расход >= 0
	|								ТОГДА ДанныеДляАнализа.Расход
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|										ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|									ИНАЧЕ ДанныеДляАнализа.РасходПоМодулю
	|								КОНЕЦ
	|						КОНЕЦ > ДанныеДляАнализа.МаксимальныйРасходЗаПериод И ДанныеДляАнализа.МаксимальныйРасходЗаПериод <> 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|	КОНЕЦ КАК СостояниеПоказаний,
	|	ДанныеДляАнализа.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеДляАнализа.ПоследниеПоказания КАК ПредыдущиеПоказания,
	|	ДанныеДляАнализа.ДопустимыйОбъемОтклонений КАК ДопустимыйОбъемОтклонений,
	|	ДанныеДляАнализа.РасходЗаАналогичныйПериодПредГода КАК РасходЗаАналогичныйПериодПредГода,
	|	ДанныеДляАнализа.РасходЗаПредМесяц КАК РасходЗаПредМесяц,
	|	ДанныеДляАнализа.ОбъемПочасовойВедомости КАК ОбъемПочасовойВедомости
	|ИЗ
	|	ДанныеДляАнализа КАК ДанныеДляАнализа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПовышающийКоэф КАК ПовышающийКоэф
	|		ПО ДанныеДляАнализа.ТарифнаяЗона = ПовышающийКоэф.ТарифнаяЗона
	|			И ДанныеДляАнализа.Услуга = ПовышающийКоэф.Услуга";  
	
	Запрос.Текст 					= Текст;	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	
	Отбор = Новый Структура("IDСтроки, ТарифнаяЗона"); 
	
	Пока выборка.Следующий() Цикл 
		СтрокаДанных = тзТаблицаПоказаний[Выборка.НомерСтроки -1];
		
		Отбор.IDСтроки  	= СтрокаДанных.IDСтроки;
		Отбор.ТарифнаяЗона	= СтрокаДанных.ТарифнаяЗона;
		СтрокаПоказаний 	= ТаблицаПоказаний.НайтиСтроки(Отбор)[0];
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры

#Область РаботаСЗагрузкойПоказанийИзВнешнихИсточников

#Область ФормированиеДокументов

// Запускает формирование регистрации показаний.
//
// Параметры:
//  ДокументОснование			-	ДокументСсылка.
//  КоличествоПотоков			-	Число			-	количество потоков.
//  ДополнительныеПараметры		-	Структура.
//
Процедура ЗапуститьФормированиеРегистрацииПоказаний(ДокументОснование, КоличествоПотоков, ДополнительныеПараметры = Неопределено) Экспорт 
	   
	Обработка = Документы.бестЗагрузкаПоказанийИзВнешнихИсточников;
	Обработка.ЗапуститьФормированиеРегистрацииПоказаний(ДокументОснование, КоличествоПотоков, ДополнительныеПараметры);
	
КонецПроцедуры

// Запускает формирование регистрации показаний по идентификаторам.
//
// Параметры:
//  ДокументОснование		-	ДокументСсылка.
//  Идентификаторы			-	Массив из УникальныйИдентификатор.
//  ДополнительныеПараметры	-	Структура.
//
Процедура ЗапуститьФормированиеРегистрацииПоказанийПоИдентификаторам(ДокументОснование, Идентификаторы, ДополнительныеПараметры = Неопределено) Экспорт
	   
	Обработка = Документы.бестЗагрузкаПоказанийИзВнешнихИсточников;
	Обработка.ЗапуститьФормированиеРегистрацииПоказанийПоИдентификаторам(ДокументОснование, Идентификаторы, ДополнительныеПараметры);
	     
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкаВводаПоказаний

Процедура ПроверитьОшибкуПрофиля(ПоказанияПриборовУчета) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказанияПриборовУчета.НомерСтроки КАК НомерСтроки,
		|	ПоказанияПриборовУчета.IDСтроки КАК IDСтроки,
		|	ПоказанияПриборовУчета.Разница КАК Разница,
		|	ПоказанияПриборовУчета.ОбъемПочасовойВедомости КАК ОбъемПочасовойВедомости,
		|	ПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний
		|ПОМЕСТИТЬ ИсходнаяТаблица
		|ИЗ
		|	&ПоказанияПриборовУчета КАК ПоказанияПриборовУчета
		|ГДЕ
		|	ПоказанияПриборовУчета.ОбъемПочасовойВедомости > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходнаяТаблица.IDСтроки КАК IDСтроки,
		|	СУММА(ИсходнаяТаблица.Разница) КАК Разница,
		|	МАКСИМУМ(ИсходнаяТаблица.ОбъемПочасовойВедомости) КАК ОбъемПочасовойВедомости
		|ПОМЕСТИТЬ ОтклоненныеПоказания
		|ИЗ
		|	ИсходнаяТаблица КАК ИсходнаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсходнаяТаблица.IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ОтклоненныеПоказания КАК ОтклоненныеПоказания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходнаяТаблица КАК ИсходнаяТаблица
		|		ПО ОтклоненныеПоказания.IDСтроки = ИсходнаяТаблица.IDСтроки
		|			И (ИсходнаяТаблица.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
		|			И (ОтклоненныеПоказания.Разница = ИсходнаяТаблица.ОбъемПочасовойВедомости = ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("ПоказанияПриборовУчета", ПоказанияПриборовУчета.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Отклонены = Перечисления.энргСостояниеПоказаний.Отклонены;
	ПричинаОтклонения = Перечисления.энргПричиныОтклоненияПоказаний.ОшибкаПрофиля;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаДанных = ПоказанияПриборовУчета[ВыборкаДетальныеЗаписи.НомерСтроки - 1]; 
		СтрокаДанных.СостояниеПоказаний  = Отклонены;
		СтрокаДанных.ПричинаОтклонения	 = ПричинаОтклонения;
	КонецЦикла;
	
КонецПроцедуры

Процедура КонтрольОшибкиДругойЗоны(ПоказанияПриборовУчета) Экспорт
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	бестРегистрацияПоказанийНППоказанияПриборовУчета.IDСтроки КАК IDСтроки,
	//	|	бестРегистрацияПоказанийНППоказанияПриборовУчета.Ссылка КАК Ссылка
	//	|ПОМЕСТИТЬ ОтклоненныеПоказания
	//	|ИЗ
	//	|	Документ." + ТипОбъекта + ".ПоказанияПриборовУчета КАК бестРегистрацияПоказанийНППоказанияПриборовУчета
	//	|ГДЕ
	//	|	бестРегистрацияПоказанийНППоказанияПриборовУчета.Ссылка = &Ссылка
	//	|	И бестРегистрацияПоказанийНППоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.отклонены)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	бестРегистрацияПоказанийНППоказанияПриборовУчета.НомерСтроки КАК НомерСтроки
	//	|ИЗ
	//	|	ОтклоненныеПоказания КАК ОтклоненныеПоказания
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + ТипОбъекта + ".ПоказанияПриборовУчета КАК бестРегистрацияПоказанийНППоказанияПриборовУчета
	//	|		ПО ОтклоненныеПоказания.IDСтроки = бестРегистрацияПоказанийНППоказанияПриборовУчета.IDСтроки
	//	|			И (ОтклоненныеПоказания.Ссылка = бестРегистрацияПоказанийНППоказанияПриборовУчета.Ссылка
	//	|				И бестРегистрацияПоказанийНППоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.приняты)
	//	|				И НЕ бестРегистрацияПоказанийНППоказанияПриборовУчета.СтатусИзмененПользователем)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказанияПриборовУчета.НомерСтроки КАК НомерСтроки,
		|	ПоказанияПриборовУчета.IDСтроки КАК IDСтроки,
		|	ПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
		|	ПоказанияПриборовУчета.СтатусИзмененПользователем КАК СтатусИзмененПользователем
		|ПОМЕСТИТЬ ИсходнаяТаблица
		|ИЗ
		|	&ПоказанияПриборовУчета КАК ПоказанияПриборовУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ИсходнаяТаблица.IDСтроки КАК IDСтроки,
		|	ИсходнаяТаблица.СостояниеПоказаний КАК СостояниеПоказаний,
		|	ИсходнаяТаблица.СтатусИзмененПользователем КАК СтатусИзмененПользователем
		|ПОМЕСТИТЬ ОтклоненныеПоказания
		|ИЗ
		|	ИсходнаяТаблица КАК ИсходнаяТаблица
		|ГДЕ
		|	ИсходнаяТаблица.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ОтклоненныеПоказания КАК ОтклоненныеПоказания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходнаяТаблица
		|		ПО ОтклоненныеПоказания.IDСтроки = ИсходнаяТаблица.IDСтроки		
		|				И ИсходнаяТаблица.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
		|				И НЕ ИсходнаяТаблица.СтатусИзмененПользователем";
	
	Запрос.УстановитьПараметр("ПоказанияПриборовУчета", ПоказанияПриборовУчета.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Отклонены = Перечисления.энргСостояниеПоказаний.Отклонены;
	ПричинаОтклонения = Перечисления.энргПричиныОтклоненияПоказаний.ОшибкаДругойЗоны;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаДанных = ПоказанияПриборовУчета[ВыборкаДетальныеЗаписи.НомерСтроки - 1]; 
		СтрокаДанных.СостояниеПоказаний  = Отклонены;
		СтрокаДанных.ПричинаОтклонения	 = ПричинаОтклонения;
	КонецЦикла;

КонецПроцедуры

Процедура КонтрольОшибкиДругойЗоныМассовыйВвод(ЭтотОбъект) Экспорт
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	 |	бестРегистрацияПоказанийНПОбщийТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	//	 |	бестРегистрацияПоказанийНПОбщийТочкиУчета.Ссылка КАК Ссылка
	//	 |ПОМЕСТИТЬ Отклоненные
	//	 |ИЗ
	//	 |	Документ.бестРегистрацияПоказанийНПОбщий.ТочкиУчета КАК бестРегистрацияПоказанийНПОбщийТочкиУчета
	//	 |ГДЕ
	//	 |	бестРегистрацияПоказанийНПОбщийТочкиУчета.Ссылка = &Ссылка
	//	 |	И бестРегистрацияПоказанийНПОбщийТочкиУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.отклонены)
	//	 |;
	//	 |
	//	 |////////////////////////////////////////////////////////////////////////////////
	//	 |ВЫБРАТЬ
	//	 |	бестРегистрацияПоказанийНПОбщийТочкиУчета.НомерСтроки КАК НомерСтроки
	//	 |ИЗ
	//	 |	Отклоненные КАК Отклоненные
	//	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРегистрацияПоказанийНПОбщий.ТочкиУчета КАК бестРегистрацияПоказанийНПОбщийТочкиУчета
	//	 |		ПО Отклоненные.Ссылка = бестРегистрацияПоказанийНПОбщийТочкиУчета.Ссылка
	//	 |			И (Отклоненные.ТочкаУчета = бестРегистрацияПоказанийНПОбщийТочкиУчета.ТочкаУчета
	//	 |				И бестРегистрацияПоказанийНПОбщийТочкиУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.приняты)
	//	 |				И НЕ бестРегистрацияПоказанийНПОбщийТочкиУчета.СтатусИзмененПользователем)";
	
	//Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказанияПриборовУчета.НомерСтроки КАК НомерСтроки,
		|	ПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета,
		|	ПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
		|	ПоказанияПриборовУчета.СтатусИзмененПользователем КАК СтатусИзмененПользователем
		|ПОМЕСТИТЬ ИсходнаяТаблица
		|ИЗ
		|	&ПоказанияПриборовУчета КАК ПоказанияПриборовУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ИсходнаяТаблица.ТочкаУчета КАК ТочкаУчета,
		|	ИсходнаяТаблица.СостояниеПоказаний КАК СостояниеПоказаний,
		|	ИсходнаяТаблица.СтатусИзмененПользователем КАК СтатусИзмененПользователем
		|ПОМЕСТИТЬ ОтклоненныеПоказания
		|ИЗ
		|	ИсходнаяТаблица КАК ИсходнаяТаблица
		|ГДЕ
		|	ИсходнаяТаблица.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ОтклоненныеПоказания КАК ОтклоненныеПоказания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходнаяТаблица
		|		ПО ОтклоненныеПоказания.ТочкаУчета = ИсходнаяТаблица.ТочкаУчета		
		|				И ИсходнаяТаблица.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
		|				И НЕ ИсходнаяТаблица.СтатусИзмененПользователем";
	
	Запрос.УстановитьПараметр("ПоказанияПриборовУчета", ЭтотОбъект.ТочкиУчета.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Отклонены = Перечисления.энргСостояниеПоказаний.Отклонены;
	ПричинаОтклонения = Перечисления.энргПричиныОтклоненияПоказаний.ОшибкаДругойЗоны;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаДанных = ЭтотОбъект.ТочкиУчета[ВыборкаДетальныеЗаписи.НомерСтроки - 1]; 
		СтрокаДанных.СостояниеПоказаний  = Отклонены;
		СтрокаДанных.ПричинаОтклонения	 = ПричинаОтклонения;		
		
	КонецЦикла;

КонецПроцедуры
	
#КонецОбласти


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаРазницаПоказанийСхожегоПериода(ТаблицаДляПомещения, ИмяНачалаПериода, ИмяКонецПериода) 
	
	Шаблон = 
	"ВЫБРАТЬ	
	|	бестПоказанияПриборовУчетаНП.ПриборУчета КАК ПриборУчета,
	|	бестПоказанияПриборовУчетаНП.Шкала КАК Шкала,
	|	бестПоказанияПриборовУчетаНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СУММА(бестПоказанияПриборовУчетаНП.Разница) КАК Разница
	|ПОМЕСТИТЬ %1
	|ИЗ
	|	РегистрСведений.бестПоказанияПриборовУчетаНП КАК бестПоказанияПриборовУчетаНП
	|ГДЕ
	|	бестПоказанияПриборовУчетаНП.Период МЕЖДУ &%2 И &%3
	|	И бестПоказанияПриборовУчетаНП.Организация = &Организация
	|	И бестПоказанияПриборовУчетаНП.Район = &Район
	|	И бестПоказанияПриборовУчетаНП.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|	И (бестПоказанияПриборовУчетаНП.ТочкаУчета, бестПоказанияПриборовУчетаНП.ПриборУчета, бестПоказанияПриборовУчетаНП.Шкала, бестПоказанияПриборовУчетаНП.ТарифнаяЗона) В
	|			(ВЫБРАТЬ
	|				ТекущиеДанные.ТочкаУчета,
	|				ТекущиеДанные.ПриборУчета,
	|				ТекущиеДанные.Шкала,
	|				ТекущиеДанные.ТарифнаяЗона
	|			ИЗ
	|				ТекущиеДанные КАК ТекущиеДанные)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПоказанияПриборовУчетаНП.ПриборУчета,	
	|	бестПоказанияПриборовУчетаНП.ТарифнаяЗона,
	|	бестПоказанияПриборовУчетаНП.Шкала" 
	+ ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Результат = СтрШаблон(Шаблон, ТаблицаДляПомещения, ИмяНачалаПериода, ИмяКонецПериода);
	Возврат Результат;
	
КонецФункции

#КонецОбласти
